; ModuleID = 'basic_math.bc'
source_filename = "../example/basic_math.c"
target datalayout = "e-m:e-p:16:16-i32:16-i64:16-f32:16-f64:16-a:8-n8:16-S16"
target triple = "msp430"

%struct.Camel = type { i16, %struct.camel_buffer_t, %struct.camel_buffer_t }
%struct.camel_buffer_t = type { [11 x i16], %struct.camel_global_t, i16 }
%struct.camel_global_t = type { i16, i16, i16, [5 x i16], [5 x i16] }

@WDTCTL = external dso_local global i16, align 2
@PADIR_L = external dso_local global i8, align 1
@PAOUT_L = external dso_local global i8, align 1
@PM5CTL0 = external dso_local global i16, align 2
@CSCTL0_H = external dso_local global i8, align 1
@CSCTL1 = external dso_local global i16, align 2
@CSCTL2 = external dso_local global i16, align 2
@CSCTL3 = external dso_local global i16, align 2
@FRCTL0 = external dso_local global i16, align 2
@camel = common dso_local global %struct.Camel zeroinitializer, align 2, !dbg !0
@safe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !24
@unsafe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !49
@tmp_stack_crc = common dso_local global i16 0, align 2, !dbg !13
@tmp_stack_buf_crc = common dso_local global i16 0, align 2, !dbg !20
@__const.task_check.ref_arr1 = private unnamed_addr constant [5 x i16] [i16 2, i16 0, i16 0, i16 0, i16 5], align 2
@__const.task_check.ref_arr2 = private unnamed_addr constant [5 x i16] [i16 0, i16 2, i16 0, i16 5, i16 5], align 2

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "camel", scope: !2, file: !3, line: 74, type: !54, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !7, nameTableKind: None)
!3 = !DIFile(filename: "../example/basic_math.c", directory: "/home/saim/Desktop/Camel/llvm_bytecode")
!4 = !{}
!5 = !{!6}
!6 = !DIBasicType(name: "unsigned int", size: 16, encoding: DW_ATE_unsigned)
!7 = !{!8, !13, !20, !22, !0, !24, !49, !51}
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "reset_vector", scope: !2, file: !3, line: 267, type: !10, isLocal: true, isDefinition: true)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 16)
!11 = !DISubroutineType(types: !12)
!12 = !{null}
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "tmp_stack_crc", scope: !2, file: !3, line: 18, type: !15, isLocal: false, isDefinition: true)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !16, line: 26, baseType: !17)
!16 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/sys/_stdint.h", directory: "/home/saim")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !18, line: 43, baseType: !19)
!18 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/machine/_default_types.h", directory: "/home/saim")
!19 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "tmp_stack_buf_crc", scope: !2, file: !3, line: 19, type: !15, isLocal: false, isDefinition: true)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "writeOpt", scope: !2, file: !3, line: 29, type: !15, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "safe", scope: !2, file: !3, line: 81, type: !26, isLocal: false, isDefinition: true)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 16)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_buffer_t", file: !3, line: 67, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_buffer_t", file: !3, line: 62, size: 400, elements: !29)
!29 = !{!30, !35, !48}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "reg_file", scope: !28, file: !3, line: 64, baseType: !31, size: 176)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 176, elements: !33)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_reg_t", file: !3, line: 14, baseType: !15)
!33 = !{!34}
!34 = !DISubrange(count: 11)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !28, file: !3, line: 65, baseType: !36, size: 208, offset: 176)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_global_t", file: !3, line: 59, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_global_t", file: !3, line: 55, size: 208, elements: !38)
!38 = !{!39, !41, !42, !43, !47}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !37, file: !3, line: 57, baseType: !40, size: 16)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_t", file: !3, line: 15, baseType: !15)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !37, file: !3, line: 57, baseType: !40, size: 16, offset: 16)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !37, file: !3, line: 57, baseType: !40, size: 16, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !37, file: !3, line: 58, baseType: !44, size: 80, offset: 48)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 80, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 5)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !37, file: !3, line: 58, baseType: !44, size: 80, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "stack_and_buf_crc", scope: !28, file: !3, line: 66, baseType: !15, size: 16, offset: 384)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "unsafe", scope: !2, file: !3, line: 81, type: !26, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "buf", scope: !2, file: !3, line: 110, type: !53, isLocal: false, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 176, elements: !33)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camel", file: !3, line: 69, size: 816, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !54, file: !3, line: 71, baseType: !15, size: 16)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "buf1", scope: !54, file: !3, line: 72, baseType: !27, size: 400, offset: 16)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "buf2", scope: !54, file: !3, line: 73, baseType: !27, size: 400, offset: 416)
!59 = !{i32 2, !"Dwarf Version", i32 4}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{i32 1, !"wchar_size", i32 2}
!62 = !{!"clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)"}
!63 = distinct !DISubprogram(name: "camel_init", scope: !3, file: !3, line: 83, type: !11, scopeLine: 83, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!64 = !DILocation(line: 84, column: 10, scope: !63)
!65 = !DILocation(line: 86, column: 9, scope: !63)
!66 = !DILocation(line: 88, column: 9, scope: !63)
!67 = !DILocation(line: 93, column: 11, scope: !63)
!68 = !DILocation(line: 98, column: 12, scope: !63)
!69 = !DILocation(line: 99, column: 10, scope: !63)
!70 = !DILocation(line: 100, column: 10, scope: !63)
!71 = !DILocation(line: 102, column: 10, scope: !63)
!72 = !DILocation(line: 103, column: 12, scope: !63)
!73 = !DILocation(line: 106, column: 10, scope: !63)
!74 = !DILocation(line: 108, column: 1, scope: !63)
!75 = distinct !DISubprogram(name: "camel_recover", scope: !3, file: !3, line: 112, type: !11, scopeLine: 112, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!76 = !DILocation(line: 113, column: 14, scope: !77)
!77 = distinct !DILexicalBlock(scope: !75, file: !3, line: 113, column: 8)
!78 = !DILocation(line: 113, column: 19, scope: !77)
!79 = !DILocation(line: 113, column: 8, scope: !75)
!80 = !DILocation(line: 114, column: 14, scope: !81)
!81 = distinct !DILexicalBlock(scope: !77, file: !3, line: 113, column: 34)
!82 = !DILocation(line: 115, column: 16, scope: !81)
!83 = !DILocation(line: 116, column: 5, scope: !81)
!84 = !DILocation(line: 116, column: 21, scope: !85)
!85 = distinct !DILexicalBlock(scope: !77, file: !3, line: 116, column: 15)
!86 = !DILocation(line: 116, column: 26, scope: !85)
!87 = !DILocation(line: 116, column: 15, scope: !77)
!88 = !DILocation(line: 117, column: 14, scope: !89)
!89 = distinct !DILexicalBlock(scope: !85, file: !3, line: 116, column: 41)
!90 = !DILocation(line: 118, column: 16, scope: !89)
!91 = !DILocation(line: 119, column: 5, scope: !89)
!92 = !DILocation(line: 120, column: 9, scope: !93)
!93 = distinct !DILexicalBlock(scope: !85, file: !3, line: 119, column: 12)
!94 = !DILocation(line: 129, column: 3, scope: !95)
!95 = distinct !DILexicalBlock(scope: !75, file: !3, line: 129, column: 3)
!96 = !{i32 -2146601175}
!97 = !DILocalVariable(name: "__x", scope: !98, file: !3, line: 131, type: !6)
!98 = distinct !DILexicalBlock(scope: !75, file: !3, line: 131, column: 33)
!99 = !DILocation(line: 131, column: 33, scope: !98)
!100 = !{i32 -2146600939}
!101 = !DILocation(line: 131, column: 51, scope: !75)
!102 = !DILocation(line: 131, column: 33, scope: !75)
!103 = !DILocalVariable(name: "__x", scope: !104, file: !3, line: 131, type: !6)
!104 = distinct !DILexicalBlock(scope: !75, file: !3, line: 131, column: 65)
!105 = !DILocation(line: 131, column: 65, scope: !104)
!106 = !{i32 -2146600814}
!107 = !DILocation(line: 131, column: 83, scope: !75)
!108 = !DILocation(line: 131, column: 63, scope: !75)
!109 = !DILocation(line: 131, column: 19, scope: !75)
!110 = !DILocation(line: 131, column: 17, scope: !75)
!111 = !DILocation(line: 132, column: 37, scope: !75)
!112 = !DILocation(line: 132, column: 71, scope: !75)
!113 = !DILocation(line: 132, column: 23, scope: !75)
!114 = !DILocation(line: 132, column: 21, scope: !75)
!115 = !DILocation(line: 135, column: 6, scope: !116)
!116 = distinct !DILexicalBlock(scope: !75, file: !3, line: 135, column: 6)
!117 = !DILocation(line: 135, column: 27, scope: !116)
!118 = !DILocation(line: 135, column: 33, scope: !116)
!119 = !DILocation(line: 135, column: 24, scope: !116)
!120 = !DILocation(line: 135, column: 6, scope: !75)
!121 = !DILocation(line: 136, column: 11, scope: !122)
!122 = distinct !DILexicalBlock(scope: !116, file: !3, line: 135, column: 51)
