; ModuleID = 'camel_cuckoo.bc'
source_filename = "../example/camel_cuckoo.c"
target datalayout = "e-m:e-p:16:16-i32:16-i64:16-f32:16-f64:16-a:8-n8:16-S16"
target triple = "msp430"

%struct.Camel = type { i16, %struct.camel_buffer_t, %struct.camel_buffer_t }
%struct.camel_buffer_t = type { [11 x i16], %struct.camel_global_t, i16 }
%struct.camel_global_t = type { [128 x i16], i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8 }

@WDTCTL = external dso_local global i16, align 2
@PADIR_L = external dso_local global i8, align 1
@PAOUT_L = external dso_local global i8, align 1
@PM5CTL0 = external dso_local global i16, align 2
@CSCTL0_H = external dso_local global i8, align 1
@CSCTL1 = external dso_local global i16, align 2
@CSCTL2 = external dso_local global i16, align 2
@CSCTL3 = external dso_local global i16, align 2
@FRCTL0 = external dso_local global i16, align 2
@camel = common dso_local global %struct.Camel zeroinitializer, align 2, !dbg !0
@safe = common dso_local local_unnamed_addr global %struct.camel_buffer_t* null, align 2, !dbg !30
@unsafe = common dso_local local_unnamed_addr global %struct.camel_buffer_t* null, align 2, !dbg !63
@tmp_stack_crc = common dso_local local_unnamed_addr global i16 0, align 2, !dbg !26
@tmp_stack_buf_crc = common dso_local local_unnamed_addr global i16 0, align 2, !dbg !28
@init_key = dso_local local_unnamed_addr constant i16 1, align 2, !dbg !14

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "camel", scope: !2, file: !3, line: 141, type: !68, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !13, nameTableKind: None)
!3 = !DIFile(filename: "../example/camel_cuckoo.c", directory: "/home/saim/Desktop/Camel/llvm_bytecode")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIBasicType(name: "unsigned int", size: 16, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 16)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !9, line: 20, baseType: !10)
!9 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/sys/_stdint.h", directory: "/home/saim")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !11, line: 29, baseType: !12)
!11 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/machine/_default_types.h", directory: "/home/saim")
!12 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!13 = !{!14, !21, !26, !28, !0, !30, !63, !65}
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "init_key", scope: !2, file: !3, line: 223, type: !16, isLocal: false, isDefinition: true)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_t", file: !3, line: 17, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !9, line: 26, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !11, line: 43, baseType: !20)
!20 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "reset_vector", scope: !2, file: !3, line: 649, type: !23, isLocal: true, isDefinition: true)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 16)
!24 = !DISubroutineType(types: !25)
!25 = !{null}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "tmp_stack_crc", scope: !2, file: !3, line: 52, type: !18, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "tmp_stack_buf_crc", scope: !2, file: !3, line: 53, type: !18, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "safe", scope: !2, file: !3, line: 148, type: !32, isLocal: false, isDefinition: true)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 16)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_buffer_t", file: !3, line: 134, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_buffer_t", file: !3, line: 129, size: 2400, elements: !35)
!35 = !{!36, !41, !62}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "reg_file", scope: !34, file: !3, line: 131, baseType: !37, size: 176)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 176, elements: !39)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_reg_t", file: !3, line: 49, baseType: !18)
!39 = !{!40}
!40 = !DISubrange(count: 11)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !34, file: !3, line: 132, baseType: !42, size: 2208, offset: 176)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_global_t", file: !3, line: 126, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_global_t", file: !3, line: 112, size: 2208, elements: !44)
!44 = !{!45, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !61}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !43, file: !3, line: 114, baseType: !46, size: 2048)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 2048, elements: !48)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "fingerprint_t", file: !3, line: 19, baseType: !18)
!48 = !{!49}
!49 = !DISubrange(count: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !43, file: !3, line: 115, baseType: !17, size: 16, offset: 2048)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !43, file: !3, line: 116, baseType: !47, size: 16, offset: 2064)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "index1", scope: !43, file: !3, line: 117, baseType: !17, size: 16, offset: 2080)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "index2", scope: !43, file: !3, line: 118, baseType: !17, size: 16, offset: 2096)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "relocation_count", scope: !43, file: !3, line: 119, baseType: !17, size: 16, offset: 2112)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "insert_count", scope: !43, file: !3, line: 120, baseType: !17, size: 16, offset: 2128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "inserted_count", scope: !43, file: !3, line: 121, baseType: !17, size: 16, offset: 2144)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_count", scope: !43, file: !3, line: 122, baseType: !17, size: 16, offset: 2160)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !43, file: !3, line: 123, baseType: !17, size: 16, offset: 2176)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "success", scope: !43, file: !3, line: 124, baseType: !60, size: 8, offset: 2192)
!60 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "member", scope: !43, file: !3, line: 125, baseType: !60, size: 8, offset: 2200)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "stack_and_buf_crc", scope: !34, file: !3, line: 133, baseType: !18, size: 16, offset: 2384)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "unsafe", scope: !2, file: !3, line: 148, type: !32, isLocal: false, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "buf", scope: !2, file: !3, line: 177, type: !67, isLocal: false, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 176, elements: !39)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camel", file: !3, line: 136, size: 4816, elements: !69)
!69 = !{!70, !71, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !68, file: !3, line: 138, baseType: !18, size: 16)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "buf1", scope: !68, file: !3, line: 139, baseType: !33, size: 2400, offset: 16)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "buf2", scope: !68, file: !3, line: 140, baseType: !33, size: 2400, offset: 2416)
!73 = !{i32 2, !"Dwarf Version", i32 4}
!74 = !{i32 2, !"Debug Info Version", i32 3}
!75 = !{i32 1, !"wchar_size", i32 2}
!76 = !{!"clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)"}
!77 = distinct !DISubprogram(name: "camel_init", scope: !3, file: !3, line: 150, type: !24, scopeLine: 150, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!78 = !DILocation(line: 151, column: 10, scope: !77)
!79 = !{!80, !80, i64 0}
!80 = !{!"int", !81, i64 0}
!81 = !{!"omnipotent char", !82, i64 0}
!82 = !{!"Simple C/C++ TBAA"}
!83 = !DILocation(line: 153, column: 9, scope: !77)
!84 = !{!81, !81, i64 0}
!85 = !DILocation(line: 155, column: 9, scope: !77)
!86 = !DILocation(line: 160, column: 11, scope: !77)
!87 = !DILocation(line: 165, column: 12, scope: !77)
!88 = !DILocation(line: 166, column: 10, scope: !77)
!89 = !DILocation(line: 167, column: 10, scope: !77)
!90 = !DILocation(line: 169, column: 10, scope: !77)
!91 = !DILocation(line: 170, column: 12, scope: !77)
!92 = !DILocation(line: 173, column: 10, scope: !77)
!93 = !DILocation(line: 175, column: 1, scope: !77)
!94 = distinct !DISubprogram(name: "camel_recover", scope: !3, file: !3, line: 179, type: !24, scopeLine: 179, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !95)
!95 = !{!96, !98}
!96 = !DILocalVariable(name: "__x", scope: !97, file: !3, line: 206, type: !6)
!97 = distinct !DILexicalBlock(scope: !94, file: !3, line: 206, column: 33)
!98 = !DILocalVariable(name: "__x", scope: !99, file: !3, line: 206, type: !6)
!99 = distinct !DILexicalBlock(scope: !94, file: !3, line: 206, column: 65)
!100 = !DILocation(line: 180, column: 14, scope: !101)
!101 = distinct !DILexicalBlock(scope: !94, file: !3, line: 180, column: 8)
!102 = !{!103, !104, i64 0}
!103 = !{!"Camel", !104, i64 0, !105, i64 2, !105, i64 302}
!104 = !{!"short", !81, i64 0}
!105 = !{!"camel_buffer_t", !81, i64 0, !106, i64 22, !104, i64 298}
!106 = !{!"camel_global_t", !81, i64 0, !104, i64 256, !104, i64 258, !104, i64 260, !104, i64 262, !104, i64 264, !104, i64 266, !104, i64 268, !104, i64 270, !104, i64 272, !107, i64 274, !107, i64 275}
!107 = !{!"_Bool", !81, i64 0}
!108 = !DILocation(line: 180, column: 8, scope: !94)
!109 = !DILocation(line: 181, column: 14, scope: !110)
!110 = distinct !DILexicalBlock(scope: !101, file: !3, line: 180, column: 34)
!111 = !{!112, !112, i64 0}
!112 = !{!"any pointer", !81, i64 0}
!113 = !DILocation(line: 182, column: 16, scope: !110)
!114 = !DILocation(line: 183, column: 5, scope: !110)
!115 = !DILocation(line: 184, column: 14, scope: !116)
!116 = distinct !DILexicalBlock(scope: !117, file: !3, line: 183, column: 41)
!117 = distinct !DILexicalBlock(scope: !101, file: !3, line: 183, column: 15)
!118 = !DILocation(line: 185, column: 16, scope: !116)
!119 = !DILocation(line: 186, column: 5, scope: !116)
!120 = !DILocation(line: 187, column: 9, scope: !121)
!121 = distinct !DILexicalBlock(scope: !117, file: !3, line: 186, column: 12)
!122 = !DILocation(line: 204, column: 3, scope: !123)
!123 = distinct !DILexicalBlock(scope: !94, file: !3, line: 204, column: 3)
!124 = !{!104, !104, i64 0}
!125 = !{i32 -2146584784}
!126 = !DILocation(line: 206, column: 33, scope: !97)
!127 = !{i32 -2146584548}
!128 = !DILocation(line: 0, scope: !97)
!129 = !DILocation(line: 206, column: 51, scope: !94)
!130 = !DILocation(line: 206, column: 33, scope: !94)
!131 = !DILocation(line: 206, column: 65, scope: !99)
!132 = !{i32 -2146584423}
!133 = !DILocation(line: 0, scope: !99)
!134 = !DILocation(line: 206, column: 63, scope: !94)
!135 = !DILocation(line: 206, column: 19, scope: !94)
!136 = !DILocation(line: 206, column: 17, scope: !94)
!137 = !DILocation(line: 207, column: 37, scope: !94)
!138 = !DILocation(line: 207, column: 23, scope: !94)
!139 = !DILocation(line: 207, column: 21, scope: !94)
