; ModuleID = 'camel_rsa.bc'
source_filename = "../benchmarks/camel_rsa.c"
target datalayout = "e-m:e-p:16:16-i32:16-i64:16-f32:16-f64:16-a:8-n8:16-S16"
target triple = "msp430"

%struct.Camel = type { i16, %struct.camel_buffer_t, %struct.camel_buffer_t }
%struct.camel_buffer_t = type { [11 x i16], %struct.camel_global_t, i16 }
%struct.camel_global_t = type { [32 x i16], i16, i16, i16, i16, i16, [32 x i16], [4 x i16], i16, i16, i16, [16 x i16], i16, i16, [32 x i16], [32 x i16], i16, i8, i16, i16 }
%struct.pubkey_t = type { [4 x i8], i16 }

@WDTCTL = external dso_local global i16, align 2
@PADIR_L = external dso_local global i8, align 1
@PAOUT_L = external dso_local global i8, align 1
@PM5CTL0 = external dso_local global i16, align 2
@CSCTL0_H = external dso_local global i8, align 1
@CSCTL1 = external dso_local global i16, align 2
@CSCTL2 = external dso_local global i16, align 2
@CSCTL3 = external dso_local global i16, align 2
@FRCTL0 = external dso_local global i16, align 2
@camel = common dso_local global %struct.Camel zeroinitializer, align 2, !dbg !0
@safe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !20
@unsafe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !67
@tmp_stack_crc = common dso_local global i16 0, align 2, !dbg !13
@tmp_stack_buf_crc = common dso_local global i16 0, align 2, !dbg !18
@pubkey = internal constant %struct.pubkey_t { [4 x i8] c"EjI\AA", i16 3 }, align 2, !dbg !72

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "camel", scope: !2, file: !3, line: 179, type: !90, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !12, nameTableKind: None)
!3 = !DIFile(filename: "../benchmarks/camel_rsa.c", directory: "/home/saim/Desktop/Camel/llvm_bytecode")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIBasicType(name: "unsigned int", size: 16, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 32, baseType: !9)
!8 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/sys/_stdint.h", directory: "/home/saim")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 65, baseType: !11)
!10 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/machine/_default_types.h", directory: "/home/saim")
!11 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !{!13, !18, !0, !20, !67, !69, !72, !84}
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "tmp_stack_crc", scope: !2, file: !3, line: 75, type: !15, isLocal: false, isDefinition: true)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !8, line: 26, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !10, line: 43, baseType: !17)
!17 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "tmp_stack_buf_crc", scope: !2, file: !3, line: 76, type: !15, isLocal: false, isDefinition: true)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "safe", scope: !2, file: !3, line: 186, type: !22, isLocal: false, isDefinition: true)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 16)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_buffer_t", file: !3, line: 172, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_buffer_t", file: !3, line: 167, size: 2784, elements: !25)
!25 = !{!26, !31, !66}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "reg_file", scope: !24, file: !3, line: 169, baseType: !27, size: 176)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 176, elements: !29)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_reg_t", file: !3, line: 72, baseType: !15)
!29 = !{!30}
!30 = !DISubrange(count: 11)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !24, file: !3, line: 170, baseType: !32, size: 2592, offset: 176)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_global_t", file: !3, line: 164, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_global_t", file: !3, line: 135, size: 2592, elements: !34)
!34 = !{!35, !40, !41, !42, !43, !44, !45, !46, !50, !51, !52, !53, !57, !58, !59, !60, !61, !62, !64, !65}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "product", scope: !33, file: !3, line: 137, baseType: !36, size: 512)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 512, elements: !38)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit_t", file: !3, line: 14, baseType: !15)
!38 = !{!39}
!39 = !DISubrange(count: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "exponent", scope: !33, file: !3, line: 138, baseType: !37, size: 16, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "exponent_next", scope: !33, file: !3, line: 139, baseType: !37, size: 16, offset: 528)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "block_offset", scope: !33, file: !3, line: 140, baseType: !6, size: 16, offset: 544)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "message_length", scope: !33, file: !3, line: 141, baseType: !6, size: 16, offset: 560)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cyphertext_len", scope: !33, file: !3, line: 142, baseType: !6, size: 16, offset: 576)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !33, file: !3, line: 143, baseType: !36, size: 512, offset: 592)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "modulus", scope: !33, file: !3, line: 144, baseType: !47, size: 64, offset: 1104)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 64, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 4)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "digit", scope: !33, file: !3, line: 145, baseType: !37, size: 16, offset: 1168)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "carry", scope: !33, file: !3, line: 146, baseType: !37, size: 16, offset: 1184)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "reduce", scope: !33, file: !3, line: 147, baseType: !6, size: 16, offset: 1200)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "cyphertext", scope: !33, file: !3, line: 148, baseType: !54, size: 256, offset: 1216)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 256, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 16)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !33, file: !3, line: 149, baseType: !6, size: 16, offset: 1472)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "n_div", scope: !33, file: !3, line: 150, baseType: !37, size: 16, offset: 1488)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "product2", scope: !33, file: !3, line: 151, baseType: !36, size: 512, offset: 1504)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !33, file: !3, line: 152, baseType: !36, size: 512, offset: 2016)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "quotient", scope: !33, file: !3, line: 153, baseType: !6, size: 16, offset: 2528)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "print_which", scope: !33, file: !3, line: 154, baseType: !63, size: 8, offset: 2544)
!63 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !33, file: !3, line: 161, baseType: !6, size: 16, offset: 2560)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "check_final", scope: !33, file: !3, line: 162, baseType: !6, size: 16, offset: 2576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "stack_and_buf_crc", scope: !24, file: !3, line: 171, baseType: !15, size: 16, offset: 2768)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "unsafe", scope: !2, file: !3, line: 186, type: !22, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "buf", scope: !2, file: !3, line: 215, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 176, elements: !29)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "pubkey", scope: !2, file: !3, line: 38, type: !74, isLocal: true, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "pubkey_t", file: !3, line: 20, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 17, size: 48, elements: !77)
!77 = !{!78, !83}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !76, file: !3, line: 18, baseType: !79, size: 32)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 32, elements: !48)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 20, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 29, baseType: !82)
!82 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !76, file: !3, line: 19, baseType: !37, size: 16, offset: 32)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "PLAINTEXT", scope: !2, file: !3, line: 42, type: !86, isLocal: true, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 72, elements: !88)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!88 = !{!89}
!89 = !DISubrange(count: 9)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camel", file: !3, line: 174, size: 5584, elements: !91)
!91 = !{!92, !93, !94}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !90, file: !3, line: 176, baseType: !15, size: 16)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "buf1", scope: !90, file: !3, line: 177, baseType: !23, size: 2784, offset: 16)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "buf2", scope: !90, file: !3, line: 178, baseType: !23, size: 2784, offset: 2800)
!95 = !{i32 2, !"Dwarf Version", i32 4}
!96 = !{i32 2, !"Debug Info Version", i32 3}
!97 = !{i32 1, !"wchar_size", i32 2}
!98 = !{!"clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)"}
!99 = distinct !DISubprogram(name: "camel_init", scope: !3, file: !3, line: 188, type: !100, scopeLine: 188, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!100 = !DISubroutineType(types: !101)
!101 = !{null}
!102 = !DILocation(line: 189, column: 10, scope: !99)
!103 = !DILocation(line: 191, column: 9, scope: !99)
!104 = !DILocation(line: 193, column: 9, scope: !99)
!105 = !DILocation(line: 198, column: 11, scope: !99)
!106 = !DILocation(line: 203, column: 12, scope: !99)
!107 = !DILocation(line: 204, column: 10, scope: !99)
!108 = !DILocation(line: 205, column: 10, scope: !99)
!109 = !DILocation(line: 207, column: 10, scope: !99)
!110 = !DILocation(line: 208, column: 12, scope: !99)
!111 = !DILocation(line: 211, column: 10, scope: !99)
!112 = !DILocation(line: 213, column: 1, scope: !99)
!113 = distinct !DISubprogram(name: "camel_recover", scope: !3, file: !3, line: 217, type: !100, scopeLine: 217, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!114 = !DILocation(line: 218, column: 14, scope: !115)
!115 = distinct !DILexicalBlock(scope: !113, file: !3, line: 218, column: 8)
!116 = !DILocation(line: 218, column: 19, scope: !115)
!117 = !DILocation(line: 218, column: 8, scope: !113)
!118 = !DILocation(line: 219, column: 14, scope: !119)
!119 = distinct !DILexicalBlock(scope: !115, file: !3, line: 218, column: 34)
!120 = !DILocation(line: 220, column: 16, scope: !119)
!121 = !DILocation(line: 221, column: 5, scope: !119)
!122 = !DILocation(line: 221, column: 21, scope: !123)
!123 = distinct !DILexicalBlock(scope: !115, file: !3, line: 221, column: 15)
!124 = !DILocation(line: 221, column: 26, scope: !123)
!125 = !DILocation(line: 221, column: 15, scope: !115)
!126 = !DILocation(line: 222, column: 14, scope: !127)
!127 = distinct !DILexicalBlock(scope: !123, file: !3, line: 221, column: 41)
!128 = !DILocation(line: 223, column: 16, scope: !127)
!129 = !DILocation(line: 224, column: 5, scope: !127)
!130 = !DILocation(line: 225, column: 9, scope: !131)
!131 = distinct !DILexicalBlock(scope: !123, file: !3, line: 224, column: 12)
!132 = !DILocation(line: 242, column: 3, scope: !133)
!133 = distinct !DILexicalBlock(scope: !113, file: !3, line: 242, column: 3)
!134 = !{i32 -2146704283}
!135 = !DILocalVariable(name: "__x", scope: !136, file: !3, line: 244, type: !6)
!136 = distinct !DILexicalBlock(scope: !113, file: !3, line: 244, column: 33)
!137 = !DILocation(line: 244, column: 33, scope: !136)
!138 = !{i32 -2146704047}
!139 = !DILocation(line: 244, column: 51, scope: !113)
!140 = !DILocation(line: 244, column: 33, scope: !113)
!141 = !DILocalVariable(name: "__x", scope: !142, file: !3, line: 244, type: !6)
!142 = distinct !DILexicalBlock(scope: !113, file: !3, line: 244, column: 65)
!143 = !DILocation(line: 244, column: 65, scope: !142)
!144 = !{i32 -2146703922}
!145 = !DILocation(line: 244, column: 83, scope: !113)
!146 = !DILocation(line: 244, column: 63, scope: !113)
!147 = !DILocation(line: 244, column: 19, scope: !113)
!148 = !DILocation(line: 244, column: 17, scope: !113)
!149 = !DILocation(line: 245, column: 37, scope: !113)
!150 = !DILocation(line: 245, column: 71, scope: !113)
!151 = !DILocation(line: 245, column: 23, scope: !113)
!152 = !DILocation(line: 245, column: 21, scope: !113)
!153 = !DILocation(line: 248, column: 6, scope: !154)
!154 = distinct !DILexicalBlock(scope: !113, file: !3, line: 248, column: 6)
!155 = !DILocation(line: 248, column: 27, scope: !154)
!156 = !DILocation(line: 248, column: 33, scope: !154)
!157 = !DILocation(line: 248, column: 24, scope: !154)
!158 = !DILocation(line: 248, column: 6, scope: !113)
