; ModuleID = 'camel_rsa.bc'
source_filename = "../benchmarks/camel_rsa.c"
target datalayout = "e-m:e-p:16:16-i32:16-i64:16-f32:16-f64:16-a:8-n8:16-S16"
target triple = "msp430"

%struct.Camel = type { i16, %struct.camel_buffer_t, %struct.camel_buffer_t }
%struct.camel_buffer_t = type { [11 x i16], %struct.camel_global_t, i16 }
%struct.camel_global_t = type { [32 x i16], i16, i16, i16, i16, i16, [32 x i16], [4 x i16], i16, i16, i16, [16 x i16], i16, i16, [32 x i16], [32 x i16], i16, i16, i16 }
%struct.pubkey_t = type { [4 x i8], i16 }

@WDTCTL = external dso_local global i16, align 2
@PADIR_L = external dso_local global i8, align 1
@PAOUT_L = external dso_local global i8, align 1
@PM5CTL0 = external dso_local global i16, align 2
@CSCTL0_H = external dso_local global i8, align 1
@CSCTL1 = external dso_local global i16, align 2
@CSCTL2 = external dso_local global i16, align 2
@CSCTL3 = external dso_local global i16, align 2
@FRCTL0 = external dso_local global i16, align 2
@camel = common dso_local global %struct.Camel zeroinitializer, align 2, !dbg !0
@safe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !20
@unsafe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !65
@tmp_stack_crc = common dso_local global i16 0, align 2, !dbg !13
@tmp_stack_buf_crc = common dso_local global i16 0, align 2, !dbg !18
@pubkey = internal constant %struct.pubkey_t { [4 x i8] c"EjI\AA", i16 3 }, align 2, !dbg !70

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "camel", scope: !2, file: !3, line: 174, type: !88, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !12, nameTableKind: None)
!3 = !DIFile(filename: "../benchmarks/camel_rsa.c", directory: "/home/saim/Desktop/Camel/llvm_bytecode")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIBasicType(name: "unsigned int", size: 16, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 32, baseType: !9)
!8 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/sys/_stdint.h", directory: "/home/saim")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 65, baseType: !11)
!10 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/machine/_default_types.h", directory: "/home/saim")
!11 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !{!13, !18, !0, !20, !65, !67, !70, !82}
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "tmp_stack_crc", scope: !2, file: !3, line: 75, type: !15, isLocal: false, isDefinition: true)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !8, line: 26, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !10, line: 43, baseType: !17)
!17 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "tmp_stack_buf_crc", scope: !2, file: !3, line: 76, type: !15, isLocal: false, isDefinition: true)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "safe", scope: !2, file: !3, line: 181, type: !22, isLocal: false, isDefinition: true)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 16)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_buffer_t", file: !3, line: 167, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_buffer_t", file: !3, line: 162, size: 2768, elements: !25)
!25 = !{!26, !31, !64}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "reg_file", scope: !24, file: !3, line: 164, baseType: !27, size: 176)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 176, elements: !29)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_reg_t", file: !3, line: 72, baseType: !15)
!29 = !{!30}
!30 = !DISubrange(count: 11)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !24, file: !3, line: 165, baseType: !32, size: 2576, offset: 176)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_global_t", file: !3, line: 159, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_global_t", file: !3, line: 135, size: 2576, elements: !34)
!34 = !{!35, !40, !41, !42, !43, !44, !45, !46, !50, !51, !52, !53, !57, !58, !59, !60, !61, !62, !63}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "product", scope: !33, file: !3, line: 137, baseType: !36, size: 512)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 512, elements: !38)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit_t", file: !3, line: 14, baseType: !15)
!38 = !{!39}
!39 = !DISubrange(count: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "exponent", scope: !33, file: !3, line: 138, baseType: !37, size: 16, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "exponent_next", scope: !33, file: !3, line: 139, baseType: !37, size: 16, offset: 528)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "block_offset", scope: !33, file: !3, line: 140, baseType: !6, size: 16, offset: 544)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "message_length", scope: !33, file: !3, line: 141, baseType: !6, size: 16, offset: 560)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cyphertext_len", scope: !33, file: !3, line: 142, baseType: !6, size: 16, offset: 576)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !33, file: !3, line: 143, baseType: !36, size: 512, offset: 592)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "modulus", scope: !33, file: !3, line: 144, baseType: !47, size: 64, offset: 1104)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 64, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 4)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "digit", scope: !33, file: !3, line: 145, baseType: !37, size: 16, offset: 1168)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "carry", scope: !33, file: !3, line: 146, baseType: !37, size: 16, offset: 1184)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "reduce", scope: !33, file: !3, line: 147, baseType: !6, size: 16, offset: 1200)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "cyphertext", scope: !33, file: !3, line: 148, baseType: !54, size: 256, offset: 1216)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 256, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 16)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !33, file: !3, line: 149, baseType: !6, size: 16, offset: 1472)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "n_div", scope: !33, file: !3, line: 150, baseType: !37, size: 16, offset: 1488)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "product2", scope: !33, file: !3, line: 151, baseType: !36, size: 512, offset: 1504)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !33, file: !3, line: 152, baseType: !36, size: 512, offset: 2016)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "quotient", scope: !33, file: !3, line: 153, baseType: !6, size: 16, offset: 2528)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !33, file: !3, line: 156, baseType: !6, size: 16, offset: 2544)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "check_final", scope: !33, file: !3, line: 157, baseType: !6, size: 16, offset: 2560)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "stack_and_buf_crc", scope: !24, file: !3, line: 166, baseType: !15, size: 16, offset: 2752)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "unsafe", scope: !2, file: !3, line: 181, type: !22, isLocal: false, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "buf", scope: !2, file: !3, line: 210, type: !69, isLocal: false, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 176, elements: !29)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "pubkey", scope: !2, file: !3, line: 38, type: !72, isLocal: true, isDefinition: true)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "pubkey_t", file: !3, line: 20, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 17, size: 48, elements: !75)
!75 = !{!76, !81}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !74, file: !3, line: 18, baseType: !77, size: 32)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 32, elements: !48)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 20, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 29, baseType: !80)
!80 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !74, file: !3, line: 19, baseType: !37, size: 16, offset: 32)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "PLAINTEXT", scope: !2, file: !3, line: 42, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 72, elements: !86)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!86 = !{!87}
!87 = !DISubrange(count: 9)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camel", file: !3, line: 169, size: 5552, elements: !89)
!89 = !{!90, !91, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !88, file: !3, line: 171, baseType: !15, size: 16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "buf1", scope: !88, file: !3, line: 172, baseType: !23, size: 2768, offset: 16)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "buf2", scope: !88, file: !3, line: 173, baseType: !23, size: 2768, offset: 2784)
!93 = !{i32 2, !"Dwarf Version", i32 4}
!94 = !{i32 2, !"Debug Info Version", i32 3}
!95 = !{i32 1, !"wchar_size", i32 2}
!96 = !{!"clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)"}
!97 = distinct !DISubprogram(name: "camel_init", scope: !3, file: !3, line: 183, type: !98, scopeLine: 183, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!98 = !DISubroutineType(types: !99)
!99 = !{null}
!100 = !DILocation(line: 184, column: 10, scope: !97)
!101 = !DILocation(line: 186, column: 9, scope: !97)
!102 = !DILocation(line: 188, column: 9, scope: !97)
!103 = !DILocation(line: 193, column: 11, scope: !97)
!104 = !DILocation(line: 198, column: 12, scope: !97)
!105 = !DILocation(line: 199, column: 10, scope: !97)
!106 = !DILocation(line: 200, column: 10, scope: !97)
!107 = !DILocation(line: 202, column: 10, scope: !97)
!108 = !DILocation(line: 203, column: 12, scope: !97)
!109 = !DILocation(line: 206, column: 10, scope: !97)
!110 = !DILocation(line: 208, column: 1, scope: !97)
!111 = distinct !DISubprogram(name: "camel_recover", scope: !3, file: !3, line: 212, type: !98, scopeLine: 212, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!112 = !DILocation(line: 213, column: 14, scope: !113)
!113 = distinct !DILexicalBlock(scope: !111, file: !3, line: 213, column: 8)
!114 = !DILocation(line: 213, column: 19, scope: !113)
!115 = !DILocation(line: 213, column: 8, scope: !111)
!116 = !DILocation(line: 214, column: 14, scope: !117)
!117 = distinct !DILexicalBlock(scope: !113, file: !3, line: 213, column: 34)
!118 = !DILocation(line: 215, column: 16, scope: !117)
!119 = !DILocation(line: 216, column: 5, scope: !117)
!120 = !DILocation(line: 216, column: 21, scope: !121)
!121 = distinct !DILexicalBlock(scope: !113, file: !3, line: 216, column: 15)
!122 = !DILocation(line: 216, column: 26, scope: !121)
!123 = !DILocation(line: 216, column: 15, scope: !113)
!124 = !DILocation(line: 217, column: 14, scope: !125)
!125 = distinct !DILexicalBlock(scope: !121, file: !3, line: 216, column: 41)
!126 = !DILocation(line: 218, column: 16, scope: !125)
!127 = !DILocation(line: 219, column: 5, scope: !125)
!128 = !DILocation(line: 220, column: 9, scope: !129)
!129 = distinct !DILexicalBlock(scope: !121, file: !3, line: 219, column: 12)
!130 = !DILocation(line: 237, column: 3, scope: !131)
!131 = distinct !DILexicalBlock(scope: !111, file: !3, line: 237, column: 3)
!132 = !{i32 -2146695705}
!133 = !DILocalVariable(name: "__x", scope: !134, file: !3, line: 239, type: !6)
!134 = distinct !DILexicalBlock(scope: !111, file: !3, line: 239, column: 33)
!135 = !DILocation(line: 239, column: 33, scope: !134)
!136 = !{i32 -2146695469}
!137 = !DILocation(line: 239, column: 51, scope: !111)
!138 = !DILocation(line: 239, column: 33, scope: !111)
!139 = !DILocalVariable(name: "__x", scope: !140, file: !3, line: 239, type: !6)
!140 = distinct !DILexicalBlock(scope: !111, file: !3, line: 239, column: 65)
!141 = !DILocation(line: 239, column: 65, scope: !140)
!142 = !{i32 -2146695344}
!143 = !DILocation(line: 239, column: 83, scope: !111)
!144 = !DILocation(line: 239, column: 63, scope: !111)
!145 = !DILocation(line: 239, column: 19, scope: !111)
!146 = !DILocation(line: 239, column: 17, scope: !111)
!147 = !DILocation(line: 240, column: 37, scope: !111)
!148 = !DILocation(line: 240, column: 71, scope: !111)
!149 = !DILocation(line: 240, column: 23, scope: !111)
!150 = !DILocation(line: 240, column: 21, scope: !111)
!151 = !DILocation(line: 243, column: 6, scope: !152)
!152 = distinct !DILexicalBlock(scope: !111, file: !3, line: 243, column: 6)
!153 = !DILocation(line: 243, column: 27, scope: !152)
!154 = !DILocation(line: 243, column: 33, scope: !152)
!155 = !DILocation(line: 243, column: 24, scope: !152)
!156 = !DILocation(line: 243, column: 6, scope: !111)
