; ModuleID = 'camel_rsa_mod.bc'
source_filename = "../benchmarks/camel_rsa.c"
target datalayout = "e-m:e-p:16:16-i32:16-i64:16-f32:16-f64:16-a:8-n8:16-S16"
target triple = "msp430"

%struct.Camel = type { i16, %struct.camel_buffer_t, %struct.camel_buffer_t }
%struct.camel_buffer_t = type { [11 x i16], %struct.camel_global_t, i16 }
%struct.camel_global_t = type { [16 x i16], i16, i16, i16, i16, i16, [16 x i16], [8 x i16], i16, i16, i16, [16 x i16], i16, i16, [16 x i16], [16 x i16], i16, i16, i16 }
%struct.pubkey_t = type { [8 x i8], i16 }

@WDTCTL = external dso_local global i16, align 2
@PADIR_L = external dso_local global i8, align 1
@PAOUT_L = external dso_local global i8, align 1
@PM5CTL0 = external dso_local global i16, align 2
@CSCTL0_H = external dso_local global i8, align 1
@CSCTL1 = external dso_local global i16, align 2
@CSCTL2 = external dso_local global i16, align 2
@CSCTL3 = external dso_local global i16, align 2
@FRCTL0 = external dso_local global i16, align 2
@camel = common dso_local global %struct.Camel zeroinitializer, align 2, !dbg !0
@safe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !25
@unsafe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !67
@pubkey = internal constant %struct.pubkey_t { [8 x i8] c"\15p\F6B\0E\82q\A6", i16 3 }, align 2, !dbg !72
@PLAINTEXT = internal constant [12 x i8] c".RRRSSSAAA.\00", align 1, !dbg !84

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "camel", scope: !2, file: !3, line: 146, type: !90, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !12, nameTableKind: None)
!3 = !DIFile(filename: "../benchmarks/camel_rsa.c", directory: "/home/saim/Desktop/Camel/llvm_bytecode")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIBasicType(name: "unsigned int", size: 16, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 32, baseType: !9)
!8 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/sys/_stdint.h", directory: "/home/saim")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 65, baseType: !11)
!10 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/machine/_default_types.h", directory: "/home/saim")
!11 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !{!13, !18, !23, !0, !25, !67, !69, !72, !84}
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "reset_vector", scope: !2, file: !3, line: 719, type: !15, isLocal: true, isDefinition: true)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 16)
!16 = !DISubroutineType(types: !17)
!17 = !{null}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "tmp_stack_crc", scope: !2, file: !3, line: 56, type: !20, isLocal: false, isDefinition: true)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !8, line: 26, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !10, line: 43, baseType: !22)
!22 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "tmp_stack_buf_crc", scope: !2, file: !3, line: 57, type: !20, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "safe", scope: !2, file: !3, line: 153, type: !27, isLocal: false, isDefinition: true)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 16)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_buffer_t", file: !3, line: 139, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_buffer_t", file: !3, line: 134, size: 1808, elements: !30)
!30 = !{!31, !36, !66}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "reg_file", scope: !29, file: !3, line: 136, baseType: !32, size: 176)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 176, elements: !34)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_reg_t", file: !3, line: 53, baseType: !20)
!34 = !{!35}
!35 = !DISubrange(count: 11)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !29, file: !3, line: 137, baseType: !37, size: 1616, offset: 176)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_global_t", file: !3, line: 131, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_global_t", file: !3, line: 106, size: 1616, elements: !39)
!39 = !{!40, !45, !46, !47, !48, !49, !50, !51, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "product", scope: !38, file: !3, line: 109, baseType: !41, size: 256)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 256, elements: !43)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit_t", file: !3, line: 17, baseType: !20)
!43 = !{!44}
!44 = !DISubrange(count: 16)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "exponent", scope: !38, file: !3, line: 110, baseType: !42, size: 16, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "exponent_next", scope: !38, file: !3, line: 111, baseType: !42, size: 16, offset: 272)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "block_offset", scope: !38, file: !3, line: 112, baseType: !6, size: 16, offset: 288)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "message_length", scope: !38, file: !3, line: 113, baseType: !6, size: 16, offset: 304)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "cyphertext_len", scope: !38, file: !3, line: 114, baseType: !6, size: 16, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !38, file: !3, line: 115, baseType: !41, size: 256, offset: 336)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "modulus", scope: !38, file: !3, line: 116, baseType: !52, size: 128, offset: 592)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 128, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 8)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "digit", scope: !38, file: !3, line: 117, baseType: !42, size: 16, offset: 720)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "carry", scope: !38, file: !3, line: 118, baseType: !42, size: 16, offset: 736)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "reduce", scope: !38, file: !3, line: 119, baseType: !6, size: 16, offset: 752)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "cyphertext", scope: !38, file: !3, line: 120, baseType: !41, size: 256, offset: 768)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !38, file: !3, line: 121, baseType: !6, size: 16, offset: 1024)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "n_div", scope: !38, file: !3, line: 122, baseType: !42, size: 16, offset: 1040)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "product2", scope: !38, file: !3, line: 123, baseType: !41, size: 256, offset: 1056)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !38, file: !3, line: 124, baseType: !41, size: 256, offset: 1312)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "quotient", scope: !38, file: !3, line: 125, baseType: !6, size: 16, offset: 1568)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !38, file: !3, line: 128, baseType: !6, size: 16, offset: 1584)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "check_final", scope: !38, file: !3, line: 129, baseType: !6, size: 16, offset: 1600)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "stack_and_buf_crc", scope: !29, file: !3, line: 138, baseType: !20, size: 16, offset: 1792)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "unsafe", scope: !2, file: !3, line: 153, type: !27, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "buf", scope: !2, file: !3, line: 182, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 176, elements: !34)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "pubkey", scope: !2, file: !3, line: 39, type: !74, isLocal: true, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "pubkey_t", file: !3, line: 23, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 20, size: 80, elements: !77)
!77 = !{!78, !83}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !76, file: !3, line: 21, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 64, elements: !53)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 20, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 29, baseType: !82)
!82 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !76, file: !3, line: 22, baseType: !42, size: 16, offset: 64)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "PLAINTEXT", scope: !2, file: !3, line: 43, type: !86, isLocal: true, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 96, elements: !88)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!88 = !{!89}
!89 = !DISubrange(count: 12)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camel", file: !3, line: 141, size: 3632, elements: !91)
!91 = !{!92, !93, !94}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !90, file: !3, line: 143, baseType: !20, size: 16)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "buf1", scope: !90, file: !3, line: 144, baseType: !28, size: 1808, offset: 16)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "buf2", scope: !90, file: !3, line: 145, baseType: !28, size: 1808, offset: 1824)
!95 = !{i32 2, !"Dwarf Version", i32 4}
!96 = !{i32 2, !"Debug Info Version", i32 3}
!97 = !{i32 1, !"wchar_size", i32 2}
!98 = !{!"clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)"}
!99 = distinct !DISubprogram(name: "camel_init", scope: !3, file: !3, line: 155, type: !16, scopeLine: 155, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!100 = !DILocation(line: 156, column: 10, scope: !99)
!101 = !DILocation(line: 158, column: 9, scope: !99)
!102 = !DILocation(line: 160, column: 9, scope: !99)
!103 = !DILocation(line: 165, column: 11, scope: !99)
!104 = !DILocation(line: 170, column: 12, scope: !99)
!105 = !DILocation(line: 171, column: 10, scope: !99)
!106 = !DILocation(line: 172, column: 10, scope: !99)
!107 = !DILocation(line: 174, column: 10, scope: !99)
!108 = !DILocation(line: 175, column: 12, scope: !99)
!109 = !DILocation(line: 178, column: 10, scope: !99)
!110 = !DILocation(line: 180, column: 1, scope: !99)
!111 = distinct !DISubprogram(name: "camel_recover", scope: !3, file: !3, line: 184, type: !16, scopeLine: 184, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!112 = !DILocation(line: 185, column: 14, scope: !113)
!113 = distinct !DILexicalBlock(scope: !111, file: !3, line: 185, column: 8)
!114 = !DILocation(line: 185, column: 19, scope: !113)
!115 = !DILocation(line: 185, column: 8, scope: !111)
!116 = !DILocation(line: 186, column: 14, scope: !117)
!117 = distinct !DILexicalBlock(scope: !113, file: !3, line: 185, column: 34)
!118 = !DILocation(line: 187, column: 16, scope: !117)
!119 = !DILocation(line: 188, column: 5, scope: !117)
!120 = !DILocation(line: 188, column: 21, scope: !121)
!121 = distinct !DILexicalBlock(scope: !113, file: !3, line: 188, column: 15)
!122 = !DILocation(line: 188, column: 26, scope: !121)
!123 = !DILocation(line: 188, column: 15, scope: !113)
!124 = !DILocation(line: 189, column: 14, scope: !125)
!125 = distinct !DILexicalBlock(scope: !121, file: !3, line: 188, column: 41)
!126 = !DILocation(line: 190, column: 16, scope: !125)
!127 = !DILocation(line: 191, column: 5, scope: !125)
!128 = !DILocation(line: 192, column: 9, scope: !129)
!129 = distinct !DILexicalBlock(scope: !121, file: !3, line: 191, column: 12)
!130 = !DILocation(line: 198, column: 5, scope: !131)
!131 = distinct !DILexicalBlock(scope: !111, file: !3, line: 198, column: 5)
!132 = !{i32 -2146650957}
!133 = !DILocation(line: 199, column: 5, scope: !111)
!134 = !DILocation(line: 200, column: 25, scope: !111)
!135 = !DILocation(line: 200, column: 31, scope: !111)
!136 = !DILocation(line: 200, column: 5, scope: !111)
!137 = !DILocation(line: 223, column: 1, scope: !111)
!138 = distinct !DISubprogram(name: "task_done", scope: !3, file: !3, line: 227, type: !16, scopeLine: 227, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!139 = !DILocation(line: 229, column: 2, scope: !138)
!140 = distinct !DISubprogram(name: "task_init", scope: !3, file: !3, line: 233, type: !16, scopeLine: 234, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!141 = !DILocalVariable(name: "i", scope: !140, file: !3, line: 235, type: !142)
!142 = !DIBasicType(name: "int", size: 16, encoding: DW_ATE_signed)
!143 = !DILocation(line: 235, column: 6, scope: !140)
!144 = !DILocalVariable(name: "message_length", scope: !140, file: !3, line: 236, type: !6)
!145 = !DILocation(line: 236, column: 11, scope: !140)
!146 = !DILocation(line: 239, column: 9, scope: !147)
!147 = distinct !DILexicalBlock(scope: !140, file: !3, line: 239, column: 2)
!148 = !DILocation(line: 239, column: 7, scope: !147)
!149 = !DILocation(line: 239, column: 14, scope: !150)
!150 = distinct !DILexicalBlock(scope: !147, file: !3, line: 239, column: 2)
!151 = !DILocation(line: 239, column: 16, scope: !150)
!152 = !DILocation(line: 239, column: 2, scope: !147)
