; ModuleID = 'camel_ar.bc'
source_filename = "../benchmarks/camel_ar.c"
target datalayout = "e-m:e-p:16:16-i32:16-i64:16-f32:16-f64:16-a:8-n8:16-S16"
target triple = "msp430"

%struct.Camel = type { i16, %struct.camel_buffer_t, %struct.camel_buffer_t }
%struct.camel_buffer_t = type { [11 x i16], %struct.camel_global_t, i16 }
%struct.camel_global_t = type { i16, i16, i16, i16, i16, i16, [3 x %struct.threeAxis_t_8], %struct.features_t, [16 x %struct.features_t], [16 x %struct.features_t], i16, i16, i16, i16, i16 }
%struct.threeAxis_t_8 = type { i8, i8, i8 }
%struct.features_t = type { i16, i16 }

@WDTCTL = external dso_local global i16, align 2
@PADIR_L = external dso_local global i8, align 1
@PAOUT_L = external dso_local global i8, align 1
@PM5CTL0 = external dso_local global i16, align 2
@CSCTL0_H = external dso_local global i8, align 1
@CSCTL1 = external dso_local global i16, align 2
@CSCTL2 = external dso_local global i16, align 2
@CSCTL3 = external dso_local global i16, align 2
@FRCTL0 = external dso_local global i16, align 2
@camel = common dso_local global %struct.Camel zeroinitializer, align 2, !dbg !0
@safe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !32
@unsafe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !86
@tmp_stack_crc = common dso_local global i16 0, align 2, !dbg !23
@tmp_stack_buf_crc = common dso_local global i16 0, align 2, !dbg !30

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "camel", scope: !2, file: !3, line: 104, type: !91, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !16, globals: !17, nameTableKind: None)
!3 = !DIFile(filename: "../benchmarks/camel_ar.c", directory: "/home/saim/Desktop/Camel/llvm_bytecode")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 40, baseType: !6, size: 16, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 16, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "MODE_IDLE", value: 3, isUnsigned: true)
!9 = !DIEnumerator(name: "MODE_TRAIN_STATIONARY", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "MODE_TRAIN_MOVING", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "MODE_RECOGNIZE", value: 0, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 35, baseType: !6, size: 16, elements: !13)
!13 = !{!14, !15}
!14 = !DIEnumerator(name: "CLASS_STATIONARY", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "CLASS_MOVING", value: 1, isUnsigned: true)
!16 = !{!6}
!17 = !{!18, !23, !30, !0, !32, !86, !88}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "reset_vector", scope: !2, file: !3, line: 619, type: !20, isLocal: true, isDefinition: true)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 16)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "tmp_stack_crc", scope: !2, file: !3, line: 68, type: !25, isLocal: false, isDefinition: true)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !26, line: 26, baseType: !27)
!26 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/sys/_stdint.h", directory: "/home/saim")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !28, line: 43, baseType: !29)
!28 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/machine/_default_types.h", directory: "/home/saim")
!29 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "tmp_stack_buf_crc", scope: !2, file: !3, line: 69, type: !25, isLocal: false, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "safe", scope: !2, file: !3, line: 111, type: !34, isLocal: false, isDefinition: true)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 16)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_buffer_t", file: !3, line: 97, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_buffer_t", file: !3, line: 92, size: 1504, elements: !37)
!37 = !{!38, !43, !85}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "reg_file", scope: !36, file: !3, line: 94, baseType: !39, size: 176)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 176, elements: !41)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_reg_t", file: !3, line: 65, baseType: !25)
!41 = !{!42}
!42 = !DISubrange(count: 11)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !36, file: !3, line: 95, baseType: !44, size: 1312, offset: 176)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_global_t", file: !3, line: 89, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_global_t", file: !3, line: 72, size: 1312, elements: !46)
!46 = !{!47, !48, !49, !51, !52, !53, !54, !68, !74, !78, !79, !80, !81, !83, !84}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pinState", scope: !45, file: !3, line: 74, baseType: !25, size: 16)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "discardedSamplesCount", scope: !45, file: !3, line: 75, baseType: !6, size: 16, offset: 16)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !45, file: !3, line: 76, baseType: !50, size: 16, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "class_t", file: !3, line: 38, baseType: !12)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "totalCount", scope: !45, file: !3, line: 77, baseType: !6, size: 16, offset: 48)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "movingCount", scope: !45, file: !3, line: 78, baseType: !6, size: 16, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "stationaryCount", scope: !45, file: !3, line: 79, baseType: !6, size: 16, offset: 80)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !45, file: !3, line: 80, baseType: !55, size: 72, offset: 96)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 72, elements: !66)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "accelReading", file: !3, line: 27, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "threeAxis_t_8", file: !3, line: 25, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 21, size: 24, elements: !59)
!59 = !{!60, !64, !65}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !58, file: !3, line: 22, baseType: !61, size: 8)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !26, line: 19, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !28, line: 27, baseType: !63)
!63 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !58, file: !3, line: 23, baseType: !61, size: 8, offset: 8)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !58, file: !3, line: 24, baseType: !61, size: 8, offset: 16)
!66 = !{!67}
!67 = !DISubrange(count: 3)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !45, file: !3, line: 81, baseType: !69, size: 32, offset: 176)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "features_t", file: !3, line: 33, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 30, size: 32, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "meanmag", scope: !70, file: !3, line: 31, baseType: !6, size: 16)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "stddevmag", scope: !70, file: !3, line: 32, baseType: !6, size: 16, offset: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "model_stationary", scope: !45, file: !3, line: 82, baseType: !75, size: 512, offset: 208)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 512, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 16)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "model_moving", scope: !45, file: !3, line: 83, baseType: !75, size: 512, offset: 720)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "trainingSetSize", scope: !45, file: !3, line: 84, baseType: !6, size: 16, offset: 1232)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "samplesInWindow", scope: !45, file: !3, line: 85, baseType: !6, size: 16, offset: 1248)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !45, file: !3, line: 86, baseType: !82, size: 16, offset: 1264)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "run_mode_t", file: !3, line: 48, baseType: !5)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !45, file: !3, line: 87, baseType: !6, size: 16, offset: 1280)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !45, file: !3, line: 88, baseType: !6, size: 16, offset: 1296)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "stack_and_buf_crc", scope: !36, file: !3, line: 96, baseType: !25, size: 16, offset: 1488)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "unsafe", scope: !2, file: !3, line: 111, type: !34, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "buf", scope: !2, file: !3, line: 140, type: !90, isLocal: false, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 176, elements: !41)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camel", file: !3, line: 99, size: 3024, elements: !92)
!92 = !{!93, !94, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !91, file: !3, line: 101, baseType: !25, size: 16)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "buf1", scope: !91, file: !3, line: 102, baseType: !35, size: 1504, offset: 16)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "buf2", scope: !91, file: !3, line: 103, baseType: !35, size: 1504, offset: 1520)
!96 = !{i32 2, !"Dwarf Version", i32 4}
!97 = !{i32 2, !"Debug Info Version", i32 3}
!98 = !{i32 1, !"wchar_size", i32 2}
!99 = !{!"clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)"}
!100 = distinct !DISubprogram(name: "camel_init", scope: !3, file: !3, line: 113, type: !21, scopeLine: 113, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !101)
!101 = !{}
!102 = !DILocation(line: 114, column: 10, scope: !100)
!103 = !{!104, !104, i64 0}
!104 = !{!"int", !105, i64 0}
!105 = !{!"omnipotent char", !106, i64 0}
!106 = !{!"Simple C/C++ TBAA"}
!107 = !DILocation(line: 116, column: 9, scope: !100)
!108 = !{!105, !105, i64 0}
!109 = !DILocation(line: 118, column: 9, scope: !100)
!110 = !DILocation(line: 123, column: 11, scope: !100)
!111 = !DILocation(line: 128, column: 12, scope: !100)
!112 = !DILocation(line: 129, column: 10, scope: !100)
!113 = !DILocation(line: 130, column: 10, scope: !100)
!114 = !DILocation(line: 132, column: 10, scope: !100)
!115 = !DILocation(line: 133, column: 12, scope: !100)
!116 = !DILocation(line: 136, column: 10, scope: !100)
!117 = !DILocation(line: 138, column: 1, scope: !100)
!118 = distinct !DISubprogram(name: "camel_recover", scope: !3, file: !3, line: 142, type: !21, scopeLine: 142, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !119)
!119 = !{!120, !122}
!120 = !DILocalVariable(name: "__x", scope: !121, file: !3, line: 169, type: !6)
!121 = distinct !DILexicalBlock(scope: !118, file: !3, line: 169, column: 33)
!122 = !DILocalVariable(name: "__x", scope: !123, file: !3, line: 169, type: !6)
!123 = distinct !DILexicalBlock(scope: !118, file: !3, line: 169, column: 65)
!124 = !DILocation(line: 143, column: 14, scope: !125)
!125 = distinct !DILexicalBlock(scope: !118, file: !3, line: 143, column: 8)
!126 = !{!127, !128, i64 0}
!127 = !{!"Camel", !128, i64 0, !129, i64 2, !129, i64 190}
!128 = !{!"short", !105, i64 0}
!129 = !{!"camel_buffer_t", !105, i64 0, !130, i64 22, !128, i64 186}
!130 = !{!"camel_global_t", !128, i64 0, !104, i64 2, !105, i64 4, !104, i64 6, !104, i64 8, !104, i64 10, !105, i64 12, !131, i64 22, !105, i64 26, !105, i64 90, !104, i64 154, !104, i64 156, !105, i64 158, !104, i64 160, !104, i64 162}
!131 = !{!"", !104, i64 0, !104, i64 2}
!132 = !DILocation(line: 143, column: 19, scope: !125)
!133 = !DILocation(line: 143, column: 8, scope: !118)
!134 = !DILocation(line: 144, column: 14, scope: !135)
!135 = distinct !DILexicalBlock(scope: !125, file: !3, line: 143, column: 34)
!136 = !{!137, !137, i64 0}
!137 = !{!"any pointer", !105, i64 0}
!138 = !DILocation(line: 145, column: 16, scope: !135)
!139 = !DILocation(line: 146, column: 5, scope: !135)
!140 = !DILocation(line: 146, column: 21, scope: !141)
!141 = distinct !DILexicalBlock(scope: !125, file: !3, line: 146, column: 15)
!142 = !DILocation(line: 146, column: 26, scope: !141)
!143 = !DILocation(line: 146, column: 15, scope: !125)
!144 = !DILocation(line: 147, column: 14, scope: !145)
!145 = distinct !DILexicalBlock(scope: !141, file: !3, line: 146, column: 41)
!146 = !DILocation(line: 148, column: 16, scope: !145)
!147 = !DILocation(line: 149, column: 5, scope: !145)
!148 = !DILocation(line: 150, column: 9, scope: !149)
!149 = distinct !DILexicalBlock(scope: !141, file: !3, line: 149, column: 12)
!150 = !DILocation(line: 167, column: 3, scope: !151)
!151 = distinct !DILexicalBlock(scope: !118, file: !3, line: 167, column: 3)
!152 = !{!128, !128, i64 0}
!153 = !{i32 -2146649282}
!154 = !DILocation(line: 169, column: 33, scope: !121)
!155 = !{i32 -2146649046}
!156 = !DILocation(line: 169, column: 33, scope: !118)
!157 = !DILocation(line: 169, column: 51, scope: !118)
!158 = !DILocation(line: 169, column: 65, scope: !123)
!159 = !{i32 -2146648921}
!160 = !DILocation(line: 169, column: 65, scope: !118)
