; ModuleID = 'camel_cem_mod.bc'
source_filename = "../benchmarks/camel_cem.c"
target datalayout = "e-m:e-p:16:16-i32:16-i64:16-f32:16-f64:16-a:8-n8:16-S16"
target triple = "msp430"

%struct.Camel = type { i16, %struct.camel_buffer_t, %struct.camel_buffer_t }
%struct.camel_buffer_t = type { [11 x i16], %struct.camel_global_t, i16 }
%struct.camel_global_t = type { i16, i16, i16, i16, i16, [128 x %struct._node_t], i16, i16, i16, i16, i16, i16, %struct._node_t, [16 x %struct._node_t], %struct._node_t, i16, i16 }
%struct._node_t = type { i16, i16, i16 }

@WDTCTL = external dso_local global i16, align 2
@PADIR_L = external dso_local global i8, align 1
@PAOUT_L = external dso_local global i8, align 1
@PM5CTL0 = external dso_local global i16, align 2
@CSCTL0_H = external dso_local global i8, align 1
@CSCTL1 = external dso_local global i16, align 2
@CSCTL2 = external dso_local global i16, align 2
@CSCTL3 = external dso_local global i16, align 2
@FRCTL0 = external dso_local global i16, align 2
@camel = common dso_local global %struct.Camel zeroinitializer, align 2, !dbg !0
@safe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !23
@unsafe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !70
@tmp_stack_crc = common dso_local global i16 0, align 2, !dbg !14
@tmp_stack_buf_crc = common dso_local global i16 0, align 2, !dbg !21
@reset_vector = internal global void ()* @camel_recover, section "__interrupt_vector_56", align 2, !dbg !9

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "camel", scope: !2, file: !3, line: 164, type: !75, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !8, nameTableKind: None)
!3 = !DIFile(filename: "../benchmarks/camel_cem.c", directory: "/home/saim/Desktop/Camel/llvm_bytecode")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIBasicType(name: "unsigned int", size: 16, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "index_t", file: !3, line: 51, baseType: !6)
!8 = !{!9, !14, !21, !0, !23, !70, !72}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "reset_vector", scope: !2, file: !3, line: 498, type: !11, isLocal: true, isDefinition: true)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 16)
!12 = !DISubroutineType(types: !13)
!13 = !{null}
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "tmp_stack_crc", scope: !2, file: !3, line: 78, type: !16, isLocal: false, isDefinition: true)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 26, baseType: !18)
!17 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/sys/_stdint.h", directory: "/home/saim")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !19, line: 43, baseType: !20)
!19 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/machine/_default_types.h", directory: "/home/saim")
!20 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "tmp_stack_buf_crc", scope: !2, file: !3, line: 79, type: !16, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "safe", scope: !2, file: !3, line: 171, type: !25, isLocal: false, isDefinition: true)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 16)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_buffer_t", file: !3, line: 157, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_buffer_t", file: !3, line: 152, size: 7408, elements: !28)
!28 = !{!29, !34, !69}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "reg_file", scope: !27, file: !3, line: 154, baseType: !30, size: 176)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 176, elements: !32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_reg_t", file: !3, line: 75, baseType: !16)
!32 = !{!33}
!33 = !DISubrange(count: 11)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !27, file: !3, line: 155, baseType: !35, size: 7216, offset: 176)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_global_t", file: !3, line: 149, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_global_t", file: !3, line: 128, size: 7216, elements: !37)
!37 = !{!38, !40, !41, !43, !44, !45, !55, !56, !57, !58, !59, !60, !61, !62, !66, !67, !68}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "letter", scope: !36, file: !3, line: 130, baseType: !39, size: 16)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "letter_t", file: !3, line: 52, baseType: !6)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "letter_idx", scope: !36, file: !3, line: 131, baseType: !6, size: 16, offset: 16)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sample", scope: !36, file: !3, line: 132, baseType: !42, size: 16, offset: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "sample_t", file: !3, line: 53, baseType: !6)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !36, file: !3, line: 133, baseType: !7, size: 16, offset: 48)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "node_count", scope: !36, file: !3, line: 134, baseType: !7, size: 16, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !36, file: !3, line: 135, baseType: !46, size: 6144, offset: 80)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 6144, elements: !53)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !3, line: 59, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_node_t", file: !3, line: 55, size: 48, elements: !49)
!49 = !{!50, !51, !52}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "letter", scope: !48, file: !3, line: 56, baseType: !39, size: 16)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !48, file: !3, line: 57, baseType: !7, size: 16, offset: 16)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !48, file: !3, line: 58, baseType: !7, size: 16, offset: 32)
!53 = !{!54}
!54 = !DISubrange(count: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !36, file: !3, line: 136, baseType: !42, size: 16, offset: 6224)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "sample_count", scope: !36, file: !3, line: 137, baseType: !7, size: 16, offset: 6240)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !36, file: !3, line: 138, baseType: !7, size: 16, offset: 6256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !36, file: !3, line: 139, baseType: !7, size: 16, offset: 6272)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !36, file: !3, line: 140, baseType: !7, size: 16, offset: 6288)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "parent_next", scope: !36, file: !3, line: 141, baseType: !7, size: 16, offset: 6304)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "parent_node", scope: !36, file: !3, line: 142, baseType: !47, size: 48, offset: 6320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_data", scope: !36, file: !3, line: 143, baseType: !63, size: 768, offset: 6368)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 768, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 16)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_node", scope: !36, file: !3, line: 144, baseType: !47, size: 48, offset: 7136)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "symbol", scope: !36, file: !3, line: 145, baseType: !7, size: 16, offset: 7184)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !36, file: !3, line: 148, baseType: !6, size: 16, offset: 7200)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "stack_and_buf_crc", scope: !27, file: !3, line: 156, baseType: !16, size: 16, offset: 7392)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "unsafe", scope: !2, file: !3, line: 171, type: !25, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "buf", scope: !2, file: !3, line: 200, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 176, elements: !32)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camel", file: !3, line: 159, size: 14832, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !75, file: !3, line: 161, baseType: !16, size: 16)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "buf1", scope: !75, file: !3, line: 162, baseType: !26, size: 7408, offset: 16)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "buf2", scope: !75, file: !3, line: 163, baseType: !26, size: 7408, offset: 7424)
!80 = !{i32 2, !"Dwarf Version", i32 4}
!81 = !{i32 2, !"Debug Info Version", i32 3}
!82 = !{i32 1, !"wchar_size", i32 2}
!83 = !{!"clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)"}
!84 = distinct !DISubprogram(name: "camel_init", scope: !3, file: !3, line: 173, type: !12, scopeLine: 173, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!85 = !DILocation(line: 174, column: 10, scope: !84)
!86 = !DILocation(line: 176, column: 9, scope: !84)
!87 = !DILocation(line: 178, column: 9, scope: !84)
!88 = !DILocation(line: 183, column: 11, scope: !84)
!89 = !DILocation(line: 188, column: 12, scope: !84)
!90 = !DILocation(line: 189, column: 10, scope: !84)
!91 = !DILocation(line: 190, column: 10, scope: !84)
!92 = !DILocation(line: 192, column: 10, scope: !84)
!93 = !DILocation(line: 193, column: 12, scope: !84)
!94 = !DILocation(line: 196, column: 10, scope: !84)
!95 = !DILocation(line: 198, column: 1, scope: !84)
!96 = distinct !DISubprogram(name: "camel_recover", scope: !3, file: !3, line: 202, type: !12, scopeLine: 202, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!97 = !DILocation(line: 203, column: 14, scope: !98)
!98 = distinct !DILexicalBlock(scope: !96, file: !3, line: 203, column: 8)
!99 = !DILocation(line: 203, column: 19, scope: !98)
!100 = !DILocation(line: 203, column: 8, scope: !96)
!101 = !DILocation(line: 204, column: 14, scope: !102)
!102 = distinct !DILexicalBlock(scope: !98, file: !3, line: 203, column: 34)
!103 = !DILocation(line: 205, column: 16, scope: !102)
!104 = !DILocation(line: 206, column: 5, scope: !102)
!105 = !DILocation(line: 206, column: 21, scope: !106)
!106 = distinct !DILexicalBlock(scope: !98, file: !3, line: 206, column: 15)
!107 = !DILocation(line: 206, column: 26, scope: !106)
!108 = !DILocation(line: 206, column: 15, scope: !98)
!109 = !DILocation(line: 207, column: 14, scope: !110)
!110 = distinct !DILexicalBlock(scope: !106, file: !3, line: 206, column: 41)
!111 = !DILocation(line: 208, column: 16, scope: !110)
!112 = !DILocation(line: 209, column: 5, scope: !110)
!113 = !DILocation(line: 210, column: 9, scope: !114)
!114 = distinct !DILexicalBlock(scope: !106, file: !3, line: 209, column: 12)
!115 = !DILocation(line: 227, column: 3, scope: !116)
!116 = distinct !DILexicalBlock(scope: !96, file: !3, line: 227, column: 3)
!117 = !{i32 -2146595622}
!118 = !DILocalVariable(name: "__x", scope: !119, file: !3, line: 229, type: !6)
!119 = distinct !DILexicalBlock(scope: !96, file: !3, line: 229, column: 33)
!120 = !DILocation(line: 229, column: 33, scope: !119)
!121 = !{i32 -2146595386}
!122 = !DILocation(line: 229, column: 51, scope: !96)
!123 = !DILocation(line: 229, column: 33, scope: !96)
!124 = !DILocalVariable(name: "__x", scope: !125, file: !3, line: 229, type: !6)
!125 = distinct !DILexicalBlock(scope: !96, file: !3, line: 229, column: 65)
!126 = !DILocation(line: 229, column: 65, scope: !125)
!127 = !{i32 -2146595261}
!128 = !DILocation(line: 229, column: 83, scope: !96)
!129 = !DILocation(line: 229, column: 63, scope: !96)
!130 = !DILocation(line: 229, column: 19, scope: !96)
!131 = !DILocation(line: 229, column: 17, scope: !96)
!132 = !DILocation(line: 230, column: 37, scope: !96)
!133 = !DILocation(line: 230, column: 71, scope: !96)
!134 = !DILocation(line: 230, column: 23, scope: !96)
!135 = !DILocation(line: 230, column: 21, scope: !96)
!136 = !DILocation(line: 233, column: 6, scope: !137)
!137 = distinct !DILexicalBlock(scope: !96, file: !3, line: 233, column: 6)
!138 = !DILocation(line: 233, column: 27, scope: !137)
!139 = !DILocation(line: 233, column: 33, scope: !137)
!140 = !DILocation(line: 233, column: 24, scope: !137)
!141 = !DILocation(line: 233, column: 6, scope: !96)
!142 = !DILocation(line: 234, column: 11, scope: !143)
