; ModuleID = 'camel_cem.bc'
source_filename = "../example/camel_cem.c"
target datalayout = "e-m:e-p:16:16-i32:16-i64:16-f32:16-f64:16-a:8-n8:16-S16"
target triple = "msp430"

%struct.Camel = type { i16, %struct.camel_buffer_t, %struct.camel_buffer_t }
%struct.camel_buffer_t = type { [11 x i16], %struct.camel_global_t, i16 }
%struct.camel_global_t = type { i16, i16, i16, i16, i16, [512 x %struct._node_t], i16, i16, i16, i16, i16, i16, %struct._node_t, [64 x %struct._node_t], %struct._node_t, i16, i16 }
%struct._node_t = type { i16, i16, i16 }

@WDTCTL = external dso_local global i16, align 2
@PADIR_L = external dso_local global i8, align 1
@PAOUT_L = external dso_local global i8, align 1
@PM5CTL0 = external dso_local global i16, align 2
@CSCTL0_H = external dso_local global i8, align 1
@CSCTL1 = external dso_local global i16, align 2
@CSCTL2 = external dso_local global i16, align 2
@CSCTL3 = external dso_local global i16, align 2
@FRCTL0 = external dso_local global i16, align 2
@camel = common dso_local global %struct.Camel zeroinitializer, align 2, !dbg !0
@safe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !18
@unsafe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !66
@tmp_stack_crc = common dso_local global i16 0, align 2, !dbg !9
@tmp_stack_buf_crc = common dso_local global i16 0, align 2, !dbg !16
@buf = common dso_local global [11 x i16] zeroinitializer, align 2, !dbg !68

; Function Attrs: noinline nounwind optnone

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "camel", scope: !2, file: !3, line: 143, type: !71, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !8, nameTableKind: None)
!3 = !DIFile(filename: "../example/camel_cem.c", directory: "/home/saim/Desktop/Camel/llvm_bytecode")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIBasicType(name: "unsigned int", size: 16, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "index_t", file: !3, line: 20, baseType: !6)
!8 = !{!9, !16, !0, !18, !66, !68}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "tmp_stack_crc", scope: !2, file: !3, line: 48, type: !11, isLocal: false, isDefinition: true)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !12, line: 26, baseType: !13)
!12 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/sys/_stdint.h", directory: "/home/saim")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !14, line: 43, baseType: !15)
!14 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/machine/_default_types.h", directory: "/home/saim")
!15 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "tmp_stack_buf_crc", scope: !2, file: !3, line: 49, type: !11, isLocal: false, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "safe", scope: !2, file: !3, line: 150, type: !20, isLocal: false, isDefinition: true)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 16)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_buffer_t", file: !3, line: 136, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_buffer_t", file: !3, line: 131, size: 28144, elements: !23)
!23 = !{!24, !29, !65}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "reg_file", scope: !22, file: !3, line: 133, baseType: !25, size: 176)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 176, elements: !27)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_reg_t", file: !3, line: 45, baseType: !11)
!27 = !{!28}
!28 = !DISubrange(count: 11)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !22, file: !3, line: 134, baseType: !30, size: 27952, offset: 176)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_global_t", file: !3, line: 128, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_global_t", file: !3, line: 108, size: 27952, elements: !32)
!32 = !{!33, !35, !36, !38, !39, !40, !50, !51, !52, !53, !54, !55, !56, !57, !61, !62, !63}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "letter", scope: !31, file: !3, line: 110, baseType: !34, size: 16)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "letter_t", file: !3, line: 21, baseType: !6)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "letter_idx", scope: !31, file: !3, line: 111, baseType: !6, size: 16, offset: 16)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sample", scope: !31, file: !3, line: 112, baseType: !37, size: 16, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "sample_t", file: !3, line: 22, baseType: !6)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !31, file: !3, line: 113, baseType: !7, size: 16, offset: 48)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "node_count", scope: !31, file: !3, line: 114, baseType: !7, size: 16, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !31, file: !3, line: 115, baseType: !41, size: 24576, offset: 80)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 24576, elements: !48)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !3, line: 28, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_node_t", file: !3, line: 24, size: 48, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "letter", scope: !43, file: !3, line: 25, baseType: !34, size: 16)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !43, file: !3, line: 26, baseType: !7, size: 16, offset: 16)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !43, file: !3, line: 27, baseType: !7, size: 16, offset: 32)
!48 = !{!49}
!49 = !DISubrange(count: 512)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !31, file: !3, line: 116, baseType: !37, size: 16, offset: 24656)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "sample_count", scope: !31, file: !3, line: 117, baseType: !7, size: 16, offset: 24672)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !31, file: !3, line: 118, baseType: !7, size: 16, offset: 24688)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !31, file: !3, line: 119, baseType: !7, size: 16, offset: 24704)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !31, file: !3, line: 120, baseType: !7, size: 16, offset: 24720)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "parent_next", scope: !31, file: !3, line: 121, baseType: !7, size: 16, offset: 24736)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "parent_node", scope: !31, file: !3, line: 122, baseType: !42, size: 48, offset: 24752)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_data", scope: !31, file: !3, line: 123, baseType: !58, size: 3072, offset: 24800)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 3072, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_node", scope: !31, file: !3, line: 124, baseType: !42, size: 48, offset: 27872)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "symbol", scope: !31, file: !3, line: 125, baseType: !7, size: 16, offset: 27920)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !31, file: !3, line: 127, baseType: !64, size: 16, offset: 27936)
!64 = !DIBasicType(name: "int", size: 16, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "stack_and_buf_crc", scope: !22, file: !3, line: 135, baseType: !11, size: 16, offset: 28128)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "unsafe", scope: !2, file: !3, line: 150, type: !20, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "buf", scope: !2, file: !3, line: 179, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 176, elements: !27)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camel", file: !3, line: 138, size: 56304, elements: !72)
!72 = !{!73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !71, file: !3, line: 140, baseType: !11, size: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "buf1", scope: !71, file: !3, line: 141, baseType: !21, size: 28144, offset: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "buf2", scope: !71, file: !3, line: 142, baseType: !21, size: 28144, offset: 28160)
!76 = !{i32 2, !"Dwarf Version", i32 4}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = !{i32 1, !"wchar_size", i32 2}
!79 = !{!"clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)"}
!80 = distinct !DISubprogram(name: "camel_init", scope: !3, file: !3, line: 152, type: !81, scopeLine: 152, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!81 = !DISubroutineType(types: !82)
!82 = !{null}
!83 = !DILocation(line: 153, column: 10, scope: !80)
!84 = !DILocation(line: 155, column: 9, scope: !80)
!85 = !DILocation(line: 157, column: 9, scope: !80)
!86 = !DILocation(line: 162, column: 11, scope: !80)
!87 = !DILocation(line: 167, column: 12, scope: !80)
!88 = !DILocation(line: 168, column: 10, scope: !80)
!89 = !DILocation(line: 169, column: 10, scope: !80)
!90 = !DILocation(line: 171, column: 10, scope: !80)
!91 = !DILocation(line: 172, column: 12, scope: !80)
!92 = !DILocation(line: 175, column: 10, scope: !80)
!93 = !DILocation(line: 177, column: 1, scope: !80)
!94 = distinct !DISubprogram(name: "camel_recover", scope: !3, file: !3, line: 181, type: !81, scopeLine: 181, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!95 = !DILocation(line: 182, column: 14, scope: !96)
!96 = distinct !DILexicalBlock(scope: !94, file: !3, line: 182, column: 8)
!97 = !DILocation(line: 182, column: 19, scope: !96)
!98 = !DILocation(line: 182, column: 8, scope: !94)
!99 = !DILocation(line: 183, column: 14, scope: !100)
!100 = distinct !DILexicalBlock(scope: !96, file: !3, line: 182, column: 34)
!101 = !DILocation(line: 184, column: 16, scope: !100)
!102 = !DILocation(line: 185, column: 5, scope: !100)
!103 = !DILocation(line: 185, column: 21, scope: !104)
!104 = distinct !DILexicalBlock(scope: !96, file: !3, line: 185, column: 15)
!105 = !DILocation(line: 185, column: 26, scope: !104)
!106 = !DILocation(line: 185, column: 15, scope: !96)
!107 = !DILocation(line: 186, column: 14, scope: !108)
!108 = distinct !DILexicalBlock(scope: !104, file: !3, line: 185, column: 41)
!109 = !DILocation(line: 187, column: 16, scope: !108)
!110 = !DILocation(line: 188, column: 5, scope: !108)
!111 = !DILocation(line: 189, column: 9, scope: !112)
!112 = distinct !DILexicalBlock(scope: !104, file: !3, line: 188, column: 12)
!113 = !DILocation(line: 206, column: 3, scope: !114)
!114 = distinct !DILexicalBlock(scope: !94, file: !3, line: 206, column: 3)
!115 = !{i32 -2146619325}
!116 = !DILocalVariable(name: "__x", scope: !117, file: !3, line: 208, type: !6)
!117 = distinct !DILexicalBlock(scope: !94, file: !3, line: 208, column: 33)
!118 = !DILocation(line: 208, column: 33, scope: !117)
!119 = !{i32 -2146619089}
!120 = !DILocation(line: 208, column: 51, scope: !94)
!121 = !DILocation(line: 208, column: 33, scope: !94)
!122 = !DILocalVariable(name: "__x", scope: !123, file: !3, line: 208, type: !6)
!123 = distinct !DILexicalBlock(scope: !94, file: !3, line: 208, column: 65)
!124 = !DILocation(line: 208, column: 65, scope: !123)
!125 = !{i32 -2146618964}
!126 = !DILocation(line: 208, column: 83, scope: !94)
!127 = !DILocation(line: 208, column: 63, scope: !94)
!128 = !DILocation(line: 208, column: 19, scope: !94)
!129 = !DILocation(line: 208, column: 17, scope: !94)
!130 = !DILocation(line: 209, column: 37, scope: !94)
!131 = !DILocation(line: 209, column: 71, scope: !94)
!132 = !DILocation(line: 209, column: 23, scope: !94)
!133 = !DILocation(line: 209, column: 21, scope: !94)
!134 = !DILocation(line: 212, column: 6, scope: !135)
!135 = distinct !DILexicalBlock(scope: !94, file: !3, line: 212, column: 6)
!136 = !DILocation(line: 212, column: 27, scope: !135)
!137 = !DILocation(line: 212, column: 33, scope: !135)
!138 = !DILocation(line: 212, column: 24, scope: !135)
!139 = !DILocation(line: 212, column: 6, scope: !94)
!140 = !DILocation(line: 213, column: 11, scope: !141)
