; ModuleID = 'camel_ar_mod.bc'
source_filename = "../benchmarks/camel_ar.c"
target datalayout = "e-m:e-p:16:16-i32:16-i64:16-f32:16-f64:16-a:8-n8:16-S16"
target triple = "msp430"

%struct.Camel = type { i16, %struct.camel_buffer_t, %struct.camel_buffer_t }
%struct.camel_buffer_t = type { [11 x i16], %struct.camel_global_t, i16 }
%struct.camel_global_t = type { i16, i16, i16, i16, i16, i16, [3 x %struct.threeAxis_t_8], %struct.features_t, [16 x %struct.features_t], [16 x %struct.features_t], i16, i16, i16, i16, i16 }
%struct.threeAxis_t_8 = type { i8, i8, i8 }
%struct.features_t = type { i16, i16 }

@WDTCTL = external dso_local global i16, align 2
@PADIR_L = external dso_local global i8, align 1
@PAOUT_L = external dso_local global i8, align 1
@PM5CTL0 = external dso_local global i16, align 2
@CSCTL0_H = external dso_local global i8, align 1
@CSCTL1 = external dso_local global i16, align 2
@CSCTL2 = external dso_local global i16, align 2
@CSCTL3 = external dso_local global i16, align 2
@FRCTL0 = external dso_local global i16, align 2
@camel = common dso_local global %struct.Camel zeroinitializer, align 2, !dbg !0
@safe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !27
@unsafe = common dso_local global %struct.camel_buffer_t* null, align 2, !dbg !81
@tmp_stack_crc = common dso_local global i16 0, align 2, !dbg !18
@tmp_stack_buf_crc = common dso_local global i16 0, align 2, !dbg !25

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "camel", scope: !2, file: !3, line: 165, type: !86, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !16, globals: !17, nameTableKind: None)
!3 = !DIFile(filename: "../benchmarks/camel_ar.c", directory: "/home/saim/Desktop/Camel/llvm_bytecode")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 37, baseType: !6, size: 16, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 16, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "MODE_IDLE", value: 3, isUnsigned: true)
!9 = !DIEnumerator(name: "MODE_TRAIN_STATIONARY", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "MODE_TRAIN_MOVING", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "MODE_RECOGNIZE", value: 0, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 32, baseType: !6, size: 16, elements: !13)
!13 = !{!14, !15}
!14 = !DIEnumerator(name: "CLASS_STATIONARY", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "CLASS_MOVING", value: 1, isUnsigned: true)
!16 = !{!6}
!17 = !{!18, !25, !0, !27, !81, !83}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "tmp_stack_crc", scope: !2, file: !3, line: 65, type: !20, isLocal: false, isDefinition: true)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !21, line: 26, baseType: !22)
!21 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/sys/_stdint.h", directory: "/home/saim")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !23, line: 43, baseType: !24)
!23 = !DIFile(filename: "ti/msp430-gcc/msp430-elf/include/machine/_default_types.h", directory: "/home/saim")
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "tmp_stack_buf_crc", scope: !2, file: !3, line: 66, type: !20, isLocal: false, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "safe", scope: !2, file: !3, line: 172, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 16)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_buffer_t", file: !3, line: 158, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_buffer_t", file: !3, line: 153, size: 1504, elements: !32)
!32 = !{!33, !38, !80}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "reg_file", scope: !31, file: !3, line: 155, baseType: !34, size: 176)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 176, elements: !36)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_reg_t", file: !3, line: 62, baseType: !20)
!36 = !{!37}
!37 = !DISubrange(count: 11)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !31, file: !3, line: 156, baseType: !39, size: 1312, offset: 176)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "camel_global_t", file: !3, line: 150, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camel_global_t", file: !3, line: 133, size: 1312, elements: !41)
!41 = !{!42, !43, !44, !46, !47, !48, !49, !63, !69, !73, !74, !75, !76, !78, !79}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "pinState", scope: !40, file: !3, line: 135, baseType: !20, size: 16)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "discardedSamplesCount", scope: !40, file: !3, line: 136, baseType: !6, size: 16, offset: 16)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !40, file: !3, line: 137, baseType: !45, size: 16, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "class_t", file: !3, line: 35, baseType: !12)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "totalCount", scope: !40, file: !3, line: 138, baseType: !6, size: 16, offset: 48)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "movingCount", scope: !40, file: !3, line: 139, baseType: !6, size: 16, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "stationaryCount", scope: !40, file: !3, line: 140, baseType: !6, size: 16, offset: 80)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !40, file: !3, line: 141, baseType: !50, size: 72, offset: 96)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 72, elements: !61)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "accelReading", file: !3, line: 24, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "threeAxis_t_8", file: !3, line: 22, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 18, size: 24, elements: !54)
!54 = !{!55, !59, !60}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !53, file: !3, line: 19, baseType: !56, size: 8)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !21, line: 19, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !23, line: 27, baseType: !58)
!58 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !53, file: !3, line: 20, baseType: !56, size: 8, offset: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !53, file: !3, line: 21, baseType: !56, size: 8, offset: 16)
!61 = !{!62}
!62 = !DISubrange(count: 3)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !40, file: !3, line: 142, baseType: !64, size: 32, offset: 176)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "features_t", file: !3, line: 30, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 27, size: 32, elements: !66)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "meanmag", scope: !65, file: !3, line: 28, baseType: !6, size: 16)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "stddevmag", scope: !65, file: !3, line: 29, baseType: !6, size: 16, offset: 16)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "model_stationary", scope: !40, file: !3, line: 143, baseType: !70, size: 512, offset: 208)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 512, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 16)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "model_moving", scope: !40, file: !3, line: 144, baseType: !70, size: 512, offset: 720)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "trainingSetSize", scope: !40, file: !3, line: 145, baseType: !6, size: 16, offset: 1232)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "samplesInWindow", scope: !40, file: !3, line: 146, baseType: !6, size: 16, offset: 1248)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !40, file: !3, line: 147, baseType: !77, size: 16, offset: 1264)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "run_mode_t", file: !3, line: 45, baseType: !5)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !40, file: !3, line: 148, baseType: !6, size: 16, offset: 1280)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !40, file: !3, line: 149, baseType: !6, size: 16, offset: 1296)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "stack_and_buf_crc", scope: !31, file: !3, line: 157, baseType: !20, size: 16, offset: 1488)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "unsafe", scope: !2, file: !3, line: 172, type: !29, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "buf", scope: !2, file: !3, line: 201, type: !85, isLocal: false, isDefinition: true)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 176, elements: !36)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camel", file: !3, line: 160, size: 3024, elements: !87)
!87 = !{!88, !89, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !86, file: !3, line: 162, baseType: !20, size: 16)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "buf1", scope: !86, file: !3, line: 163, baseType: !30, size: 1504, offset: 16)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "buf2", scope: !86, file: !3, line: 164, baseType: !30, size: 1504, offset: 1520)
!91 = !{i32 2, !"Dwarf Version", i32 4}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{i32 1, !"wchar_size", i32 2}
!94 = !{!"clang version 10.0.0 (https://github.com/llvm/llvm-project.git f79f68975d51b389d9f141aa30ab47723a75a868)"}
!95 = distinct !DISubprogram(name: "camel_init", scope: !3, file: !3, line: 174, type: !96, scopeLine: 174, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !98)
!96 = !DISubroutineType(types: !97)
!97 = !{null}
!98 = !{}
!99 = !DILocation(line: 175, column: 10, scope: !95)
!100 = !DILocation(line: 177, column: 9, scope: !95)
!101 = !DILocation(line: 179, column: 9, scope: !95)
!102 = !DILocation(line: 184, column: 11, scope: !95)
!103 = !DILocation(line: 189, column: 12, scope: !95)
!104 = !DILocation(line: 190, column: 10, scope: !95)
!105 = !DILocation(line: 191, column: 10, scope: !95)
!106 = !DILocation(line: 193, column: 10, scope: !95)
!107 = !DILocation(line: 194, column: 12, scope: !95)
!108 = !DILocation(line: 197, column: 10, scope: !95)
!109 = !DILocation(line: 199, column: 1, scope: !95)
!110 = distinct !DISubprogram(name: "camel_recover", scope: !3, file: !3, line: 203, type: !96, scopeLine: 203, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !98)
!111 = !DILocation(line: 204, column: 14, scope: !112)
!112 = distinct !DILexicalBlock(scope: !110, file: !3, line: 204, column: 8)
!113 = !DILocation(line: 204, column: 19, scope: !112)
!114 = !DILocation(line: 204, column: 8, scope: !110)
!115 = !DILocation(line: 205, column: 14, scope: !116)
!116 = distinct !DILexicalBlock(scope: !112, file: !3, line: 204, column: 34)
!117 = !DILocation(line: 206, column: 16, scope: !116)
!118 = !DILocation(line: 207, column: 5, scope: !116)
!119 = !DILocation(line: 207, column: 21, scope: !120)
!120 = distinct !DILexicalBlock(scope: !112, file: !3, line: 207, column: 15)
!121 = !DILocation(line: 207, column: 26, scope: !120)
!122 = !DILocation(line: 207, column: 15, scope: !112)
!123 = !DILocation(line: 208, column: 14, scope: !124)
!124 = distinct !DILexicalBlock(scope: !120, file: !3, line: 207, column: 41)
!125 = !DILocation(line: 209, column: 16, scope: !124)
!126 = !DILocation(line: 210, column: 5, scope: !124)
!127 = !DILocation(line: 211, column: 9, scope: !128)
!128 = distinct !DILexicalBlock(scope: !120, file: !3, line: 210, column: 12)
!129 = !DILocation(line: 228, column: 3, scope: !130)
!130 = distinct !DILexicalBlock(scope: !110, file: !3, line: 228, column: 3)
!131 = !{i32 -2146701990}
!132 = !DILocalVariable(name: "__x", scope: !133, file: !3, line: 230, type: !6)
!133 = distinct !DILexicalBlock(scope: !110, file: !3, line: 230, column: 33)
!134 = !DILocation(line: 230, column: 33, scope: !133)
!135 = !{i32 -2146701754}
!136 = !DILocation(line: 230, column: 51, scope: !110)
!137 = !DILocation(line: 230, column: 33, scope: !110)
!138 = !DILocalVariable(name: "__x", scope: !139, file: !3, line: 230, type: !6)
!139 = distinct !DILexicalBlock(scope: !110, file: !3, line: 230, column: 65)
!140 = !DILocation(line: 230, column: 65, scope: !139)
!141 = !{i32 -2146701629}
!142 = !DILocation(line: 230, column: 83, scope: !110)
!143 = !DILocation(line: 230, column: 63, scope: !110)
!144 = !DILocation(line: 230, column: 19, scope: !110)
!145 = !DILocation(line: 230, column: 17, scope: !110)
!146 = !DILocation(line: 231, column: 37, scope: !110)
!147 = !DILocation(line: 231, column: 71, scope: !110)
!148 = !DILocation(line: 231, column: 23, scope: !110)
!149 = !DILocation(line: 231, column: 21, scope: !110)
!150 = !DILocation(line: 234, column: 6, scope: !151)
!151 = distinct !DILexicalBlock(scope: !110, file: !3, line: 234, column: 6)
!152 = !DILocation(line: 234, column: 27, scope: !151)
!153 = !DILocation(line: 234, column: 33, scope: !151)
!154 = !DILocation(line: 234, column: 24, scope: !151)
!155 = !DILocation(line: 234, column: 6, scope: !110)
